base/Documents/бит_УстановкаЗначенийПроизвольныхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаЗначенийПроизвольныхПараметров</Name>
			<BasedOn>
				<xr:Item>ChartOfCharacteristicTypes.бит_ВидыПроизвольныхПараметров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЗначенияПроизвольныхПараметров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПроизвольныхПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПараметра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыПроизвольныхПараметров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_УстановкаЗначенийПроизвольныхПараметров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаЗначенийПроизвольногоПараметра(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	ЗначенияПроизвольногоПараметра = Результат[НомераТаблиц["ЗначенияПроизвольногоПараметра"]].Выгрузить();
	ПараметрыПроведения.Вставить("ЗначенияПроизвольногоПараметра", ЗначенияПроизвольногоПараметра);

	Возврат ПараметрыПроведения;

КонецФункции

Функция УстановитьЗначенияПроизвольныхПараметов(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДокумента = ПараметрыПроведения.ЗначенияПроизвольногоПараметра;
	
	СоставныеАналитики = Новый Массив;
	КоличествоАналитикДокумента = 4;
	Для Сч = 1 По КоличествоАналитикДокумента Цикл
		ПараметрыАналитики = НовыеПараметрыАналитики();
		ПараметрыАналитики.ИмяАналитики       = "Аналитика_" + Сч;
		ПараметрыАналитики.ДоступноЗаполнение = (Сч <= ПараметрыПроведения.Реквизиты.КоличествоАналитикПараметра);
		
		СоставныеАналитики.Добавить(ПараметрыАналитики);
	КонецЦикла;
	
	НаборЗаписей = Движения.бит_ЗначенияПроизвольныхПараметров;
	НаборЗаписей.Записывать = Истина;
	
	Для каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
		Для каждого ПараметрыАналитики Из СоставныеАналитики Цикл
			ОчиститьЗначениеНеиспользуемыхАналитик(Запись, ПараметрыАналитики);
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция АтрибутыПроизвольногоПараметра(ПроизвольныйПараметр, ОграничениеКоличествоАналитикДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.НомерСтроки КАК НомерСтроки,
	|	Список.Аналитика.Наименование КАК НаименованиеАналитики,
	|	Список.Аналитика.ТипЗначения КАК ТипЗначенияАналитики,
	|	Список.Аналитика.ИмяПредопределенныхДанных КАК АналитикаИмяПредопределенныхДанных,
	|	Список.Аналитика КАК Аналитика
	|ИЗ
	|	ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ИспользованиеАналитики КАК Список
	|ГДЕ
	|	Список.Ссылка = &Ссылка
	|	И Список.НомерСтроки <= &ОграничениеКоличествоАналитикДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", ПроизвольныйПараметр);
	Запрос.УстановитьПараметр("ОграничениеКоличествоАналитикДокумента", ОграничениеКоличествоАналитикДокумента);
	ВыборкаАтрибутов = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаАтрибутов;
	
КонецФункции

Процедура ПодготовитьДокументКЗаписи(ДокументОбъект) Экспорт
		
	ВыборкаАтрибутов = АтрибутыПроизвольногоПараметра(ДокументОбъект.Параметр, 4);
	Колонки = Новый Структура;
	Для Индекс = 1 По 4 Цикл
		Если ВыборкаАтрибутов.НайтиСледующий(Индекс, "НомерСтроки") Тогда
			Колонки.Вставить("Аналитика_" + Индекс, ВыборкаАтрибутов.ТипЗначенияАналитики);
		Иначе	
			Колонки.Вставить("Аналитика_" + Индекс);
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из ДокументОбъект.ЗначенияПараметра Цикл
		Для каждого КлючЗначение Из Колонки Цикл
			Колонка 	= КлючЗначение.Ключ;
			ТипЗначения = КлючЗначение.Значение;
			Если ТипЗначения = Неопределено Тогда
				СтрокаТаблицы[Колонка] = Неопределено;
			Иначе	
				СтрокаТаблицы[Колонка] = ТипЗначения.ПривестиЗначение(СтрокаТаблицы[Колонка]);
				Если НЕ ЗначениеЗаполнено(Колонка) Тогда
					СтрокаТаблицы[Колонка] = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Ссылка КАК Ссылка,
	|	РеквизитыДокумента.Номер КАК Номер,
	|	РеквизитыДокумента.Дата КАК Дата,
	|	РеквизитыДокумента.Параметр КАК Параметр,
	|	РеквизитыДокумента.Сценарий КАК Сценарий,
	|	РеквизитыДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеквизитыДокумента.Параметр.КоличествоАналитик КАК КоличествоАналитикПараметра
	|ИЗ
	|	Документ.бит_УстановкаЗначенийПроизвольныхПараметров КАК РеквизитыДокумента
	|ГДЕ
	|	РеквизитыДокумента.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаЗначенийПроизвольногоПараметра(НомераТаблиц)
	
	НомераТаблиц.Вставить("ЗначенияПроизвольногоПараметра", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗначенияПроизвольногоПараметра.Ссылка.Дата КАК Период,
	|	ЗначенияПроизвольногоПараметра.Ссылка.Параметр КАК Параметр,
	|	ЗначенияПроизвольногоПараметра.Ссылка.Сценарий КАК Сценарий,
	|	ЗначенияПроизвольногоПараметра.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗначенияПроизвольногоПараметра.Аналитика_1 КАК Аналитика_1,
	|	ЗначенияПроизвольногоПараметра.Аналитика_2 КАК Аналитика_2,
	|	ЗначенияПроизвольногоПараметра.Аналитика_3 КАК Аналитика_3,
	|	ЗначенияПроизвольногоПараметра.Аналитика_4 КАК Аналитика_4,
	|	ЗначенияПроизвольногоПараметра.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	Документ.бит_УстановкаЗначенийПроизвольныхПараметров.ЗначенияПараметра КАК ЗначенияПроизвольногоПараметра
	|ГДЕ
	|	ЗначенияПроизвольногоПараметра.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция НовыеПараметрыАналитики()
	
	ПараметрыАналитики = Новый Структура;
	
	ПараметрыАналитики.Вставить("ИмяАналитики"      , "");
	ПараметрыАналитики.Вставить("ДоступноЗаполнение", Ложь);
	
	Возврат ПараметрыАналитики;
	
КонецФункции

Процедура ОчиститьЗначениеНеиспользуемыхАналитик(Запись, ПараметрыАналитики)
	
	ИмяАналитики = ПараметрыАналитики.ИмяАналитики;
	Если НЕ ПараметрыАналитики.ДоступноЗаполнение Тогда
		// Значения аналитик документа превышающие количество аналитик в параметре очищаются безусловно.
		Запись[ИмяАналитики] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
